Repository: takhirovs1/quizlymarket
Catalog: lib/src/common/localization/intl_*.arb
Languages: uz

source: No internet connection
uz: Internet mavjud emas

# noInternetConnectionDescription
source: Please check your internet connection and try again.
uz: Iltimos, internet ulanishini tekshirib yana urinib ko‘ring.

source: Refresh
uz: Yangilash

source: App Configuration
uz: Ilova sozlamalari

# appConfigurationDescription
source: Configure your app settings here.
uz: Ilova sozlamalarini shu yerda sozlang.

# appConfigurationSave
source: Save
uz: Saqlash

# appConfigurationCancel
source: Cancel
uz: Bekor qilish

# appConfigurationReset
source: Reset
uz: Tiklash

# appConfigurationResetDescription
source: Reset your app settings to default.
uz: Ilova sozlamalarini sukut bo‘yicha tiklang.

source: Press back again to exit
uz: Chiqish uchun yana bir marta bosing

# language
source: Change language
uz: Tilni o‘zgartirish

source: English
uz: Ingliz tili

source: Russian
uz: Rus tili

source: Uzbek
uz: O‘zbek tili

# report
source: Reports
uz: Hisobotlar

source: Sign out
uz: Chiqish

# logoutConfirmMessage
source: Are you sure you want to logout?
uz: Chiqishni tasdiqlaysizmi?

# logoutConfirm
source: Logout
uz: Chiqish

# logoutCancel
source: Cancel
uz: Bekor qilish

source: Buy
uz: Sotib olish

source: Cart
uz: Savat

source: Test purchased
uz: Test sotib olindi

# personalizedTestDescription
source: You can start the test customized for you.
uz: Testni o‘zingizga moslab boshlashingiz mumkin.

source: Enter test
uz: Testga kirish

source: Cancel
uz: Bekor qilish

# testPurchasedDescription
source: You can start the test customized for you.
uz: Testni o‘zingizga moslab boshlashingiz mumkin.

# testPurchasedTitle
source: Test purchased!
uz: Test sotib olindi!

source: Start test
uz: Testni boshlash

source: Parameters:
uz: Parametrlar:

# testModeLabel
source: Test mode:
uz: Test rejimi:

# testModeCustom
source: Custom
uz: Moslashtirilgan

# testModeUniversity
source: University
uz: Universitet

# testModeQuestionTime
source: How long should it take to answer each question on the test?
uz: Testda har bir savolga javob berish uchun qancha vaqt ketishi kerak?

source: Open test
uz: Testga kirish

# changeQuestionOrAnswer
source: Should the questions and answer variants be shuffled?
uz: Savollar va javob variantlari aralashtirilsinmi?

# shuffleAll
source: Shuffle everything
uz: Barchasini aralashtirish

# shuffleNone
source: Do not shuffle
uz: Aralashtirilmasin

# shuffleQuestions
source: Questions only
uz: Faqat savollar

# shuffleAnswers
source: Answers only
uz: Faqat javoblar

# selectQuestionByRange
source: Select questions by range:
uz: Savollarni oraliq bo’yicha tanlash:

# allOfTimeTest
source: Total test time:
uz: Testning umumiy vaqti:

# questionRangeHint
source: {solved} questions will rotate out of {count}.
uz: {count} ta savoldan 25 tasi almashib tushadi.

# testTotalTime30Min
source: 30 min
uz: 30 daqiqa

# testTotalTime1Hour
source: 1 hour
uz: 1 soat

source: Correct
uz: Toʻgʻri

source: Wrong
uz: Xato

source: Skipped
uz: Tashlab ketilgan

source: Time
uz: Vaqt
